УчетВУправляющихДляГит1/src/DataProcessors/ОбращениеВТехническуюПоддержку/ОбращениеВТехническуюПоддержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбращениеВТехническуюПоддержку</name>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресВоВременномХранилище</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СпособОценкиМПЗ</name>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиТоваровВРознице</name>
    <type>
      <types>EnumRef.СпособыОценкиТоваровВРознице</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойСчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВыпускПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОказаниеУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДиректКостинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокСписанияРасходовНаСебестоимостьУслуг</name>
    <type>
      <types>EnumRef.ПорядокСписанияРасходовНаСебестоимостьУслуг</types>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьСебестоимостьПолуфабрикатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиПроизводства</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиПродукции</types>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьСебестоимостьУслугСобственнымПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаВыпускаГотовойПродукции</name>
    <type>
      <types>EnumRef.СпособыУчетаВыпускаГотовойПродукции</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьРасходыПоЭлементамЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьРасходыПоСтатьямЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантБухгалтерскойОтчетности</name>
    <type>
      <types>EnumRef.ВариантыБухгалтерскойОтчетности</types>
    </type>
  </resources>
  <resources>
    <name>ПоддержкаПБУ18</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПлановуюСебестоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантУчетаОтложенногоНалога</name>
    <type>
      <types>EnumRef.ВариантыУчетаОтложенногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>РасходыОбслуживающихПроизводствВключатьВПрочиеРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиСистемыНалогообложения/НастройкиСистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСистемыНалогообложения</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСНПатент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяОсобыйПорядокНалогообложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСНДоходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСНДоходыМинусРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъектНалогообложенияУСН</name>
    <type>
      <types>EnumRef.ОбъектыНалогообложенияПоУСН</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикТорговогоСбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяНалогНаПрофессиональныйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиУчетаНалогаНаПрибыль/НастройкиУчетаНалогаНаПрибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНалогаНаПрибыль</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ПорядокУплатыАвансов</name>
    <type>
      <types>EnumRef.ПорядокУплатыАвансовПоНалогуНаПрибыль</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>СпособПогашенияСтоимостиСпецодежды</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиНУ</types>
    </type>
  </resources>
  <resources>
    <name>БазаРаспределенияКосвенныхРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходовПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаФБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаСубъектРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяютсяРазныеСтавкиНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УплачиватьНалогПоГруппамОбособленныхПодразделений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиУчетаУСН/НастройкиУчетаУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаУСН</name>
  <informationRegisterPeriodicity>Quarter</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодРаспределенияРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.МетодыРаспределенияРасходовУСНПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>БазаРаспределенияРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазаРаспределенияРасходовУСНПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОтраженияАванса</name>
    <type>
      <types>EnumRef.ПорядокОтраженияАвансов</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПризнанияМатериальныхРасходов</name>
    <type>
      <types>EnumRef.ПорядокПризнанияМатериальныхРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПризнанияРасходовПоТоварам</name>
    <type>
      <types>EnumRef.ПорядокПризнанияРасходовПоТоварам</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПризнанияРасходовПоНДС</name>
    <type>
      <types>EnumRef.ПорядокПризнанияРасходовПоНДС</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПризнанияДопРасходов</name>
    <type>
      <types>EnumRef.ПорядокПризнанияДопРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПризнанияТаможенныхПлатежей</name>
    <type>
      <types>EnumRef.ПорядокПризнанияТаможенныхПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>НалоговыеКаникулы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиУчетаНДС/НастройкиУчетаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНДС</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПрименяетсяОсвобождениеОтУплатыНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СложныйУчетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РаздельныйУчетНДСДо2014Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РаздельныйУчетНДСНаСчете19</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УпрощенныйУчетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьНДСПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьНДСПриПередачеНедвижимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРегистрацииСчетовФактурНаАванс</name>
    <type>
      <types>EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиУчетаНДФЛ/НастройкиУчетаНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНДФЛ</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнойВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельностиПредпринимателей</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоВидамДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвансыВключаютсяВДоходыВПериодеПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидДеятельностиДоходовПоАвансам</name>
    <type>
      <types>CatalogRef.ВидыДеятельностиПредпринимателей</types>
    </type>
  </resources>
  <resources>
    <name>ДляПризнанияРасходовТребуетсяПолучениеДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПризнаватьРасходыПоОперациямПрошлогоГода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП/НастройкиУчетаСтраховыхВзносовИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаСтраховыхВзносовИП</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>УплачиватьДобровольныеВзносыВФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/DataProcessors/ОбращениеВТехническуюПоддержку/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает адрес технической поддержки для отправки сообщения
//
// Возвращаемое значение:
//   Структура
//
Функция АдресТехподдержки() Экспорт
	
	// квартплата +
	Возврат УПЖКХ_ИнформацияОРазработчикеИПрограмме.АдресТехническойПоддержки();
	// квартплата -
	
КонецФункции

// Возвращает адрес хранилища файла с текстовым документом,
// содержащим техническую информация о приложении
// Возвращаемое значение:
//	 АдресВременногоХранилища - Строка - Адрес хранилища сформированного файла
//
// Параметры
// ПараметрыНастройкиПрограммы - Структура - Структура, содержащая ключи:
//								ВидПриложения - Вид приложения
//								Логин - Логин пользователя в Интернет поддержке пользователя
//								Регистрационный номер - Регистрационный номер конфигурации
//								Уникальный идентификатор - УникальныйИдентификатор
//
Функция ТехническаяИнформация(ПараметрыТехническойИнфорации) Экспорт
	
	ТехническаяИнформация = Новый ТекстовыйДокумент;
	ТехническаяИнформация.ДобавитьСтроку(ТекстВложенияТехническаяИнформация(ПараметрыТехническойИнфорации));
	
	ИмяФайлаТехническаяИнформация = ПолучитьИмяВременногоФайла("txt");
	ТехническаяИнформация.Записать(ИмяФайлаТехническаяИнформация);
	
	Возврат ПоместитьВоВременноеХранилище(
		Новый ДвоичныеДанные(ИмяФайлаТехническаяИнформация), 
		ПараметрыТехническойИнфорации.УникальныйИдентификатор);

КонецФункции

// Возвращает адрес хранилища файла с текстовым документом,
// содержащим настройки программы
// Возвращаемое значение:
//	 АдресВременногоХранилища - Строка - Адрес хранилища сформированного файла
//
// Параметры
// ПараметрыНастройкиПрограммы - Структура - Структура, содержащая ключи:
//								Организация - Организация, по которой будет получена учетная политика
//								Уникальный идентификатор - УникальныйИдентификатор
//
Функция НастройкиПрограммы(ПараметрыНастройкиПрограммы) Экспорт
	
	НастройкиПрограммы = Новый ТекстовыйДокумент;
	
	ДобавитьСекциюИнтерфейс(НастройкиПрограммы);
	ДобавитьСекциюФункциональность(НастройкиПрограммы);
	ДобавитьСекциюПараметрыУчета(НастройкиПрограммы);
	ДобавитьСекциюУчетнаяПолитика(НастройкиПрограммы, ПараметрыНастройкиПрограммы.Организация);
	ДобавитьСекциюОбмены(НастройкиПрограммы);
	ДобавитьСекциюПерсональныеНастройки(НастройкиПрограммы);
	// квартплата +
	ДобавитьСекциюЖКХ(НастройкиПрограммы, ПараметрыНастройкиПрограммы.Организация); // ЖКХ
	// квартплата -
	
	ИмяФайлаНастройкиПрограммы = ПолучитьИмяВременногоФайла("txt");
	НастройкиПрограммы.Записать(ИмяФайлаНастройкиПрограммы);
	
	Возврат ПоместитьВоВременноеХранилище(
		Новый ДвоичныеДанные(ИмяФайлаНастройкиПрограммы), 
		ПараметрыНастройкиПрограммы.УникальныйИдентификатор);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТехническаяИнформация

Функция ТекстВложенияТехническаяИнформация(Параметры)

	// Общие технические параметры и информация о сеансе
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЭтоФайловаяИБ = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	// Общая информация:
	Результат = НСтр("ru = 'Техническая информация о программе:
		|Название программы: %1
		|Имя программы: %2;
		|Версия программы: %3;
		|Поставщик: %4;
		|Версия платформы: %5;
		|%6;
		|Вид приложения: %7;
		|Режим: %8;'");
		
	ВерсииПодсистем = Новый Массив;
	Для Каждого СтрокаВерсии Из ОбновлениеИнформационнойБазы.ВерсииПодсистем() Цикл
		ВерсииПодсистем.Добавить(
			СтрШаблон(НСтр("ru='Версия %1: %2'"), 
				СтрокаВерсии.ИмяПодсистемы,
				СтрокаВерсии.Версия));
	КонецЦикла;
	Результат =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Результат,
			Метаданные.Синоним,
			Метаданные.Имя,
			Метаданные.Версия,
			Метаданные.Поставщик,
			СистемнаяИнформация.ВерсияПриложения,
			СтрСоединить(ВерсииПодсистем, Символы.ПС),
			Параметры.ВидПриложения,
			?(ЭтоФайловаяИБ, НСтр("ru = 'Файловый'"), НСтр("ru = 'Серверный'")));
			
	// Права:
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Полные права: %1;
				|Права администратора: %2;'"),
			?(Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь), НСтр("ru = 'есть'"), НСтр("ru = 'нет'")),
			?(Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь), НСтр("ru = 'есть'"), НСтр("ru = 'нет'")));
	
	// Личные данные:
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Логин для подключения Интернет-поддержки: %1;
			|Регистрационный номер программного продукта: %2;'"),
			Параметры.ЛогинПользователя,
			Параметры.РегистрационныйНомер);
	
	// Настройки соединения:
	НастройкиСоединения = ИнтернетПоддержкаПользователей.НастройкиСоединенияССерверами();
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Настройки соединения с серверами Интернет-поддержки:
				|	Таймаут: %1;
				|	Устанавливать соединение на сервере 1С:Предприятие: %2;
				|	Доменная зона: %3'"),
			НастройкиСоединения.ТаймаутПодключения,
			?(ЭтоФайловаяИБ,
				Ложь,
				(НастройкиСоединения.УстанавливатьПодключениеНаСервере = 1)),
			?(НастройкиСоединения.ДоменРасположенияСерверовИПП = 1, "1c.eu", "1c.ru"));
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область НастройкиПрограммы

Процедура ДобавитьСекциюИнтерфейс(НастройкиПрограммы)

	НастройкиПрограммы.ДобавитьСтроку("<Cекция Интерфейс>");
	
	// Получим вариант интерфейса
	НастройкиКлиента  = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	ВариантИнтерфейса = ?(ТипЗнч(НастройкиКлиента) = Тип("НастройкиКлиентскогоПриложения"),
		НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения,
		ВариантИнтерфейсаКлиентскогоПриложения.Такси);
	Если ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		ТекстВариантИнтерфейса = "Такси";
	Иначе
		ТекстВариантИнтерфейса = "В закладках";
	КонецЕсли;
	НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("Интерфейс=%1", ТекстВариантИнтерфейса));
	
	// Получим значения служебных констант
	ИменаКонстант = Новый Массив;
	ИменаКонстант.Добавить("ИнтерфейсВерсии77");
	ИменаКонстант.Добавить("ИнтерфейсТакси");
	ИменаКонстант.Добавить("ИнтерфейсТаксиПростой");
	
	НаборКонстант = Константы.СоздатьНабор(ИменаКонстант);
	НаборКонстант.Прочитать();
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКонстанты, НаборКонстант[ИмяКонстанты]));
	КонецЦикла;
	
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

Процедура ДобавитьСекциюФункциональность(НастройкиПрограммы)
	
	НастройкиПрограммы.ДобавитьСтроку("");
	НастройкиПрограммы.ДобавитьСтроку("<Cекция Функциональность>");
	
	// Получим значения констант
	ИменаКонстант = Обработки.ФункциональностьПрограммы.СписокВсейФункциональности();
	НаборКонстант = Константы.СоздатьНабор(ИменаКонстант);
	НаборКонстант.Прочитать();
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКонстанты, НаборКонстант[ИмяКонстанты]));
	КонецЦикла;
	
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

Процедура ДобавитьСекциюПараметрыУчета(НастройкиПрограммы)
	
	НастройкиПрограммы.ДобавитьСтроку("");
	НастройкиПрограммы.ДобавитьСтроку("<Cекция Параметры учета>");
	
	ИменаКонстант = Новый Массив;
	ИменаКонстант.Добавить("ИспользоватьСтатьиДвиженияДенежныхСредств");
	ИменаКонстант.Добавить("ИспользоватьОтложенноеПроведение");
	ИменаКонстант.Добавить("СрокОплатыПокупателей");
	ИменаКонстант.Добавить("СрокОплатыПоставщикам");
	ИменаКонстант.Добавить("СрокОплатыСчетовПокупателю");
	ИменаКонстант.Добавить("ОтключитьКонтрольОтрицательныхОстатков");
	ИменаКонстант.Добавить("ДополнительнаяКолонкаПечатныхФормДокументов");
	ИменаКонстант.Добавить("ЗагрузкаДанныхИзТиС");
	ИменаКонстант.Добавить("ВестиУчетЗатратПоПодразделениям");
	ИменаКонстант.Добавить("РасчетЗарплатыДляНебольшихОрганизаций");
	ИменаКонстант.Добавить("РассчитыватьДокументыПриРедактировании");
	НаборКонстант = Константы.СоздатьНабор(ИменаКонстант);
	НаборКонстант.Прочитать();
	
	Для Каждого ИмяКонстанты Из ИменаКонстант Цикл
		НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКонстанты, НаборКонстант[ИмяКонстанты]));
	КонецЦикла;
	
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

Процедура ДобавитьСекциюУчетнаяПолитика(НастройкиПрограммы, Организация)
	
	НастройкиПрограммы.ДобавитьСтроку("");
	НастройкиПрограммы.ДобавитьСтроку("<Cекция Учетная политика>");
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Бухгалтерский учет>");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетнаяПолитикаСрезПоследних.СпособОценкиМПЗ,
		|	УчетнаяПолитикаСрезПоследних.СпособОценкиТоваровВРознице,
		|	УчетнаяПолитикаСрезПоследних.ОсновнойСчетУчетаЗатрат,
		|	УчетнаяПолитикаСрезПоследних.ВыпускПродукции,
		|	УчетнаяПолитикаСрезПоследних.ОказаниеУслуг,
		|	УчетнаяПолитикаСрезПоследних.ДиректКостинг,
		|	УчетнаяПолитикаСрезПоследних.ПорядокСписанияРасходовНаСебестоимостьУслуг,
		|	УчетнаяПолитикаСрезПоследних.РассчитыватьСебестоимостьПолуфабрикатов,
		|	УчетнаяПолитикаСрезПоследних.СпособРасчетаСебестоимостиПроизводства,
		|	УчетнаяПолитикаСрезПоследних.РассчитыватьСебестоимостьУслугСобственнымПодразделениям,
		|	УчетнаяПолитикаСрезПоследних.СпособУчетаВыпускаГотовойПродукции,
		|	УчетнаяПолитикаСрезПоследних.УчитыватьРасходыПоЭлементамЗатрат,
		|	УчетнаяПолитикаСрезПоследних.УчитыватьРасходыПоСтатьямЗатрат,
		|	УчетнаяПолитикаСрезПоследних.ФормироватьРезервыПоСомнительнымДолгам,
		|	УчетнаяПолитикаСрезПоследних.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств,
		|	УчетнаяПолитикаСрезПоследних.ВариантБухгалтерскойОтчетности,
		|	УчетнаяПолитикаСрезПоследних.ПоддержкаПБУ18
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(, Организация = &Организация) КАК УчетнаяПолитикаСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Система налогообложения");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ДатаПереходаНаУСН,
		|	НастройкиСистемыНалогообложенияСрезПоследних.УведомлениеНомер,
		|	НастройкиСистемыНалогообложенияСрезПоследних.УведомлениеДата,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСН,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикНалогаНаПрибыль,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикНДФЛ,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикЕНВД,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСНПатент,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяОсобыйПорядокНалогообложения,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСНДоходы,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСНДоходыМинусРасходы,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ОбъектНалогообложенияУСН,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикНДС,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикТорговогоСбора
		|ИЗ
		|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Налог на прибыль");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.ПорядокУплатыАвансов,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.МетодНачисленияАмортизации,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.СпособПогашенияСтоимостиСпецодежды,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.БазаРаспределенияКосвенныхРасходовПоВидамДеятельности,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.ФормироватьРезервыПоСомнительнымДолгам,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.СтавкаФБ,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.СтавкаСубъектРФ,
		|	НастройкиУчетаНалогаНаПрибыльСрезПоследних.ПрименяютсяРазныеСтавкиНалогаНаПрибыль
		|ИЗ
		|	РегистрСведений.НастройкиУчетаНалогаНаПрибыль.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНалогаНаПрибыльСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Настройки учета УСН");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаУСНСрезПоследних.СтавкаНалога,
		|	НастройкиУчетаУСНСрезПоследних.МетодРаспределенияРасходовПоВидамДеятельности,
		|	НастройкиУчетаУСНСрезПоследних.БазаРаспределенияРасходовПоВидамДеятельности,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокОтраженияАванса,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокПризнанияМатериальныхРасходов,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокПризнанияРасходовПоТоварам,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокПризнанияРасходовПоНДС,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокПризнанияДопРасходов,
		|	НастройкиУчетаУСНСрезПоследних.ПорядокПризнанияТаможенныхПлатежей,
		|	НастройкиУчетаУСНСрезПоследних.НалоговыеКаникулы,
		|	НастройкиУчетаУСНСрезПоследних.Патент
		|ИЗ
		|	РегистрСведений.НастройкиУчетаУСН.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаУСНСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Налог на добавленную стоимость (НДС)");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаНДССрезПоследних.ПрименяетсяОсвобождениеОтУплатыНДС,
		|	НастройкиУчетаНДССрезПоследних.СложныйУчетНДС,
		|	НастройкиУчетаНДССрезПоследних.РаздельныйУчетНДСДо2014Года,
		|	НастройкиУчетаНДССрезПоследних.РаздельныйУчетНДСНаСчете19,
		|	НастройкиУчетаНДССрезПоследних.УпрощенныйУчетНДС,
		|	НастройкиУчетаНДССрезПоследних.НачислятьНДСПоОтгрузке,
		|	НастройкиУчетаНДССрезПоследних.НачислятьНДСПриПередачеНедвижимости,
		|	НастройкиУчетаНДССрезПоследних.ПорядокРегистрацииСчетовФактурНаАванс
		|ИЗ
		|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Налог на доходы физических лиц (по предпринимательской деятельности)");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаНДФЛСрезПоследних.ОсновнойВидДеятельности,
		|	НастройкиУчетаНДФЛСрезПоследних.ВестиУчетПоВидамДеятельности,
		|	НастройкиУчетаНДФЛСрезПоследних.АвансыВключаютсяВДоходыВПериодеПолучения,
		|	НастройкиУчетаНДФЛСрезПоследних.ВидДеятельностиДоходовПоАвансам,
		|	НастройкиУчетаНДФЛСрезПоследних.ДляПризнанияРасходовТребуетсяПолучениеДохода,
		|	НастройкиУчетаНДФЛСрезПоследних.ПризнаватьРасходыПоОперациямПрошлогоГода
		|ИЗ
		|	РегистрСведений.НастройкиУчетаНДФЛ.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаНДФЛСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		//
		НастройкиПрограммы.ДобавитьСтроку("<Cекция Страховые взносы предпринимателя");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаСтраховыхВзносовИПСрезПоследних.УплачиватьДобровольныеВзносыВФСС
		|ИЗ
		|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаСтраховыхВзносовИПСрезПоследних";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаУчетнойПолитики = РезультатЗапроса.Выгрузить();
			СтрокаТаблицы = ТаблицаУчетнойПолитики[0];
			Для Каждого Колонка Из ТаблицаУчетнойПолитики.Колонки Цикл
				ИмяКолонки = Колонка.Имя;
				НастройкиПрограммы.ДобавитьСтроку(СтрШаблон("%1=%2", ИмяКолонки, СтрокаТаблицы[ИмяКолонки]));
			КонецЦикла;
		КонецЕсли;
		НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
		
		
		
	КонецЕсли;
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

Процедура ДобавитьСекциюОбмены(НастройкиПрограммы)
	
	НастройкиПрограммы.ДобавитьСтроку("");
	НастройкиПрограммы.ДобавитьСтроку("<Cекция Обмены>");
	УстановитьПривилегированныйРежим(Истина);
	НастройкиПрограммы.ДобавитьСтроку(
		СтрШаблон("Используется РИБ=%1", ОбщегоНазначенияБП.ИспользуютсяПланыОбмена(Истина)));
	НастройкиПрограммы.ДобавитьСтроку(
		СтрШаблон("Используется обмены с другими конфигурациями=%1", ОбщегоНазначенияБП.ИспользуютсяПланыОбмена(Ложь)));
	УстановитьПривилегированныйРежим(Ложь);
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

Процедура ДобавитьСекциюПерсональныеНастройки(НастройкиПрограммы)
	
	НастройкиПрограммы.ДобавитьСтроку("");
	НастройкиПрограммы.ДобавитьСтроку("<Cекция персональные настройки>");
	НастройкиПрограммы.ДобавитьСтроку(
		СтрШаблон("ИспользоватьТабличныеФормыБанковскихДокументов=%1", Константы.ИспользоватьТабличныеФормыБанковскихДокументов.Получить()));
	НастройкиПрограммы.ДобавитьСтроку(
		СтрШаблон("Пользователь управляет счетами учета=%1", СчетаУчетаВДокументахВызовСервераПовтИсп.ПользовательУправляетСчетамиУчета()));
	НастройкиПрограммы.ДобавитьСтроку("<КонецCекции>");
	
КонецПроцедуры

// квартплата +
Процедура ДобавитьСекциюЖКХ(НастройкиПрограммы, Организация)
	
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюНастройкаПрограммыЖКХ(НастройкиПрограммы);
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюНастройкаПараметровУчетаЖКХ(НастройкиПрограммы);
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюУчетнаяПолитикаЖКХ(НастройкиПрограммы, Организация);
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюНастройкиФормированияПлатежногоДокумента(НастройкиПрограммы, Организация);
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюНастройкиУчетаПоКапремонту(НастройкиПрограммы, Организация);
	УПЖКХ_ИнформацияОРазработчикеИПрограммеСервер.ДобавитьСекциюНастройкаПараметровСистемыЛицензирования(НастройкиПрограммы);
	
КонецПроцедуры
// квартплата -

#КонецОбласти

#КонецОбласти

#КонецЕсли
